---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.BorderRightLineStyle
source: html/88e85cfe-217f-9a7e-fd47-19bc8e033b0a.htm
---
# Autodesk.Revit.DB.TableCellStyle.BorderRightLineStyle Property

The element id (GraphicsStyle element) for the right line of the cell border.

## Syntax (C#)
```csharp
public ElementId BorderRightLineStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null